tap "cloudflare/cloudflare"
tap "dart-lang/dart"
tap "homebrew/services"
tap "lizardbyte/homebrew"
tap "mongodb/brew"
tap "sass/sass"

# shell
brew "fzf"
brew "eza"
brew "zoxide"
brew "ripgrep"
brew "tree"
brew "watch"
brew "wget"
brew "htop"
brew "telnet"

# editor
brew "just"

# git
brew "git"

# node
brew "fnm"

# ruby
brew "rbenv"

# python
brew "python@3.13"

# media
brew "ffmpeg"
brew "imagemagick"
brew "yt-dlp"
brew "unrar"

# misc
brew "cloudflared"
brew "web-ext"
brew "gmp"
brew "libffi"
brew "pango"

# terminal
brew "tmux"

# fonts + apps
cask "font-meslo-lg-nerd-font"
cask "basictex"
cask "x2goclient"
cask "xquartz"

# vscode extensions
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "github.copilot-chat"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "tamasfe.even-better-toml"
vscode "waderyan.gitblame"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
