tap "cloudflare/cloudflare"
tap "dart-lang/dart"
tap "homebrew/services"
tap "lizardbyte/homebrew"
tap "mongodb/brew"
tap "jeremywrnr/tap"
tap "sass/sass"

# shell
brew "fzf"
brew "eza"
brew "zoxide"
brew "ripgrep"
brew "tree"
brew "watch"
brew "wget"
brew "htop"
brew "telnet"

# git
brew "git"
brew "gh"

# node
brew "fnm"

# ruby
brew "rbenv"

# python
brew "python@3.13"
brew "uv"

# media
brew "ffmpeg"
brew "imagemagick"
brew "yt-dlp"
brew "unrar"

# personal
brew "apple-to-last-fm"

# misc
brew "cloudflared"
brew "web-ext"
brew "gmp"
brew "just"
brew "libffi"
brew "pango"

# terminal
brew "tmux"

# fonts + apps
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "basictex"
cask "zed"
